In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [7]:
df1 = DataFrame(np.arange(8).reshape(2, 4), index=pd.Index(['NY', 'LA'], name='City'), 
                columns = pd.Index(['A', 'B', 'C', 'D'], name='Letter')) #create data frame with named index and columns

In [8]:
df1 #unstacked data frame

Letter  A  B  C  D
City
NY      0  1  2  3
LA      4  5  6  7

In [9]:
df_st = df1.stack()
df_st # stacked the data frame

City  Letter
NY    A         0
      B         1
      C         2
      D         3
LA    A         4
      B         5
      C         6
      D         7
dtype: int32

In [10]:
df_st.unstack()

Letter  A  B  C  D
City
NY      0  1  2  3
LA      4  5  6  7

In [11]:
df_st.unstack('Letter') #unstack from letter index

Letter  A  B  C  D
City
NY      0  1  2  3
LA      4  5  6  7

In [12]:
df_st.unstack('City') # unstack from city index

City    NY  LA
Letter
A        0   4
B        1   5
C        2   6
D        3   7

In [13]:
ser1 = Series([0, 1, 2], index=['Q', 'X', 'Y'])
ser1

Q    0
X    1
Y    2
dtype: int64

In [14]:
ser2 = Series([3, 4, 5], index=['X', 'Y', 'Z'])
ser2

X    3
Y    4
Z    5
dtype: int64

In [16]:
df = pd.concat([ser1, ser2], keys=['Alpha', 'Beta'])
df # concatenating the 2 series

Alpha  Q    0
       X    1
       Y    2
Beta   X    3
       Y    4
       Z    5
dtype: int64

In [17]:
df.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  3.0  4.0  5.0

In [18]:
df.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    3.0
       Y    4.0
       Z    5.0
dtype: float64

In [30]:
dataFrame = pd.concat([ser1, ser2], keys=['Alpha', 'Beta'])
dataFrame

Alpha  Q    0
       X    1
       Y    2
Beta   X    3
       Y    4
       Z    5
dtype: int64

In [32]:
dataFrame.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  3.0  4.0  5.0

In [34]:
dataFrame.unstack().stack() #WARNING: if you use unstack or stack method twice, there will be an error.

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    3.0
       Y    4.0
       Z    5.0
dtype: float64

In [36]:
dataFrame.unstack().stack(dropna=False)

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    3.0
       Y    4.0
       Z    5.0
dtype: float64